Revit 2027 API
UpdaterInfo.IsOptional Property
 Whether the updater is optional or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsOptional { get; }
Public ReadOnly Property IsOptional As Boolean
	Get
public:
property bool IsOptional {
	bool get ();
}
member IsOptional : bool with get
Property Value
Boolean
See Also
Reference
UpdaterInfo Class
Autodesk.Revit.DB Namespace